function [lowerbound, upperbound, dimension, fitness] = fun_info(F)

    switch F
        % New functions with custom bounds
        case 'Fun_case30'
            fitness = @Fun_case30;
            lowerbound = [0.25, 0.25, 0.25, 0.25, 0.25, -0.13, -0.33, -0.24, -0.308, -0.25, -0.33, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.95, 0.95, 0.95, 0.95, 0.95, 0.95];
            upperbound = [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.05, 1.05, 1.05, 1.05, 1.05, 1.05];
            dimension = 23;
        case 'Fun_ieee30'
            fitness = @Fun_ieee30;
            lowerbound = [0.95, 0.95, 0.95, 0.95, 0.95, 0.95, 0.90, 0.90, 0.90, 0.90...
                             0,    0,    0,    0,    0,    0,    0,    0,    0, 50, 20, 15, 10, 10, 12];
            upperbound = [1.10, 1.10, 1.10, 1.10, 1.10, 1.10, 1.10, 1.10, 1.10, 1.10...
                            5,    5,  5,  5,  5,  5, 5,  5,  5, 200, 80, 50, 35, 30, 40];
            dimension = 25;
        case 'Fun_case118'
            fitness = @Fun_case118;
            lowerbound = [0,   0,   0,   0,   0,   0,   0,   0,   0,   0, ...
                          0,   0,   0,   0,   0,   0,   0,   0,   0,   0, ...
                          0,   0,   0,   0,   0,   0,   0,   0,   0,   0, ...
                          0,   0,   0,   0,   0,   0,   0,   0,   0,   0, ...
                          0,   0,   0,   0,   0,   0,   0,   0,   0,   0, ...
                          0,   0,   0,   0,   0.95,0.95,0.95,0.95,0.95,0.95, ...
                          0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95, ...
                          0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95, ...
                          0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95, ...
                          0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95, ...
                          0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.90,0.90, ...
                          0.90,0.90,0.90,0.90,0.90,0.90,0.90,0,   0,   0,   ...
                          0,   0,   0,   0,   0,   0,   0,   0,   0];
            upperbound =  [100, 100, 100, 100, 550, 185, 100, 100, 100, 100, ...
                          320, 414, 100, 107, 100, 100, 100, 100, 100, 119, ...
                          304, 148, 100, 100, 255, 260, 100, 491, 492, 805.2, ...
                          100, 100, 100, 100, 100, 100, 577, 100, 104, 707, ...
                          100, 100, 100, 100, 352, 140, 100, 100, 100, 100, ...
                          136, 100, 100, 100, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, ...
                          1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, ...
                          1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, ...
                          1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, ...
                          1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, ...
                          1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, ...
                          1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 30,  30,  30 , ...
                          30,  30,  30,  30,  30,  30,  30,  30,  30];
            dimension = 129;
        otherwise
            error('Function name not recognized');
    end
    
    end
    
function y = Fun_case30(x)
    xMax = [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.05, 1.05, 1.05, 1.05, 1.05, 1.05];
    xMin = [0.25, 0.25, 0.25, 0.25, 0.25, -0.13, -0.33, -0.24, -0.308, -0.25, -0.33, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.95, 0.95, 0.95, 0.95, 0.95, 0.95];
    data = case30;
    data.gen(2:6, 2) = x(1:5) .* (data.gen(2:6, 2))'; % 发电机有功功率
    data.gen(:, 3) = x(6:11) .* (data.gen(:, 3))';  % 发电机无功功率
    data.gen(:, 6) = x(12:17); % 发电机电压幅值
    data.branch(1:6, 9) = x(18:23); %变压器分接头位置
    opt = mpoption('VERBOSE', 0, 'OUT_ALL', 0);
    res = runpf(data, opt);
    Ploss = sum(res.branch(:, 14) + res.branch(:, 16)); % 网损

    % 计算成本
    Cost = 0;
    for i = 1:6
        P = res.gen(i, 2);
        Cost = Cost + res.gencost(i, 5) * P^2 + res.gencost(i, 6) * P;
    end

    % 计算惩罚函数
    penalty = 0;
    for i = 1:size(x, 1)
        if x(i) > xMax(i) 
            penalty = penalty + (x(i) - xMax(i)) * 5000;
        end
        if x(i) < xMin(i)
            penalty = penalty + (xMin(i) - x(i)) * 5000;
        end
    end

    % 计算电压稳定性
    V = res.bus(:, 8);
    Stability = 0; % the sum of the voltage deviation
    for i = 1:size(V, 1)
        Stability = Stability + (V(i) - 1)^2;
        if V(i) < 0.94 || V(i) > 1.06
           penalty = penalty + V(i)*0.3;
        end
    end 

    y = Cost + penalty;
end

function y = Fun_ieee30(x)
    %       V1,   V2,   V5,   V8,   V11,  V13   T11   T12   T15   T36  
    %       Q10   Q12   Q15   Q17   Q20   Q21   Q23   Q24   Q29
    xMax = [1.10, 1.10, 1.10, 1.10, 1.10, 1.10, 1.10, 1.10, 1.10, 1.10...
        5,    5,  5,  5,  5,  5, 5,  5,  5, 200, 80, 50, 35, 30, 40];
    xMin = [0.95, 0.95, 0.95, 0.95, 0.95, 0.95, 0.90, 0.90, 0.90, 0.90...
        0,    0,    0,    0,    0,    0,    0,    0,    0, 50, 20, 15, 10, 10, 12];
    data = case_ieee30;
    data.gen(:, 6) = x(1 : 6); % 发电机电压幅值
    data.branch(11, 9) = x(7); % 变压器分接头位置
    data.branch(12, 9) = x(8); 
    data.branch(15, 9) = x(9); 
    data.branch(36, 9) = x(10);
    % 并联电容无功补偿
    data.bus(10, 6) = x(11);
    data.bus(12, 6) = x(12);
    data.bus(15, 6) = x(13);
    data.bus(17, 6) = x(14);
    data.bus(20, 6) = x(15);
    data.bus(21, 6) = x(16);
    data.bus(23, 6) = x(17);
    data.bus(24, 6) = x(18);
    data.bus(29, 6) = x(19);
    data.gen(2:6, 2) = x(21:25); % 发电机有功功率
    opt = mpoption('VERBOSE', 0, 'OUT_ALL', 0);
    res = runpf(data, opt);
    Ploss = sum(res.branch(:, 14) + res.branch(:, 16)); % 网损
    Cost = 0;
    for i = 1:6
        P = res.gen(i, 2);
        Cost = Cost + res.gencost(i, 5) * P^2 + res.gencost(i, 6) * P;
    end
    penalty = 0;
    for i = 1:25
        if x(i) > xMax(i) 
            penalty = penalty + (x(i) - xMax(i))^2 * 50 + 5;
        end
        if x(i) < xMin(i)
            penalty = penalty + (xMin(i) - x(i))^2 * 50 + 5;
        end
    end
    Vmax = 1.06;
    Vmin = 0.94;
    V = res.bus(:, 8);
    for i = 1:30
        if V(i) > Vmax
            penalty = penalty + (V(i) - Vmax) * 100;
        end
        if V(i) < Vmin
            penalty = penalty + (Vmin - V(i)) * 100;
        end
    end
    y = Ploss + penalty;
end

function y = Fun_case118(x)
    % 1-54: P  55-108: V 109-117: T 118-129: Q
    xMax = [100, 100, 100, 100, 550, 185, 100, 100, 100, 100, ...
        320, 414, 100, 107, 100, 100, 100, 100, 100, 119, ...
        304, 148, 100, 100, 255, 260, 100, 491, 492, 805.2, ...
        100, 100, 100, 100, 100, 100, 577, 100, 104, 707, ...
        100, 100, 100, 100, 352, 140, 100, 100, 100, 100, ...
        136, 100, 100, 100, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, ...
        1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, ...
        1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, ...
        1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, ...
        1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, ...
        1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, ...
        1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 1.1, 30,  30,  30 , ...
        30,  30,  30,  30,  30,  30,  30,  30,  30];
    xMin = [0,   0,   0,   0,   0,   0,   0,   0,   0,   0, ...
        0,   0,   0,   0,   0,   0,   0,   0,   0,   0, ...
        0,   0,   0,   0,   0,   0,   0,   0,   0,   0, ...
        0,   0,   0,   0,   0,   0,   0,   0,   0,   0, ...
        0,   0,   0,   0,   0,   0,   0,   0,   0,   0, ...
        0,   0,   0,   0,   0.95,0.95,0.95,0.95,0.95,0.95, ...
        0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95, ...
        0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95, ...
        0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95, ...
        0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95, ...
        0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.95,0.90,0.90, ...
        0.90,0.90,0.90,0.90,0.90,0.90,0.90,0,   0,   0,   ...
        0,   0,   0,   0,   0,   0,   0,   0,   0];
    data = case118;
    data.gen(:, 2) = x(1:54); % 发电机有功功率
    data.gen(:, 6) = x(55:108); % 发电机电压幅值
    data.branch(8, 9) = x(109); % 变压器分接头位置
    data.branch(32, 9) = x(110);
    data.branch(36, 9) = x(111);
    data.branch(61, 9) = x(112);
    data.branch(93, 9) = x(113);
    data.branch(95, 9) = x(114);
    data.branch(102, 9) = x(115);
    data.branch(107, 9) = x(116);
    data.branch(127, 9) = x(117);
    data.bus(34, 6) = x(118); % 并联电容无功补偿
    data.bus(44, 6) = x(119);
    data.bus(45, 6) = x(120);
    data.bus(46, 6) = x(121);
    data.bus(48, 6) = x(122);
    data.bus(74, 6) = x(123);
    data.bus(79, 6) = x(124);
    data.bus(82, 6) = x(125);
    data.bus(83, 6) = x(126);
    data.bus(105, 6) = x(127);
    data.bus(107, 6) = x(128);
    data.bus(110, 6) = x(129);
    opt = mpoption('VERBOSE', 0, 'OUT_ALL', 0);
    res = runpf(data, opt);
    Ploss = sum(res.branch(:, 14) + res.branch(:, 16)); % 网损
    Cost = 0;
    for i = 1:54
        P = res.gen(i, 2);
        Cost = Cost + res.gencost(i, 5) * P^2 + res.gencost(i, 6) * P;
    end
    penalty = 0;
    for i = 1:129
        if x(i) > xMax(i) 
            penalty = penalty + (x(i) - xMax(i))^2 * 50 + 5;
        end
        if x(i) < xMin(i)
            penalty = penalty + (xMin(i) - x(i))^2 * 50 + 5;
        end
    end
    Vmax = 1.06;
    Vmin = 0.94;
    V = res.bus(:, 8);
    for i = 1:118
        if V(i) > Vmax
            penalty = penalty + (V(i) - Vmax) * 100 + 5000000;
        end
        if V(i) < Vmin
            penalty = penalty + (Vmin - V(i)) * 100 + 5000000;
        end
    end
    y = Cost + penalty;
end



